<?php
$this->pageTitle=Yii::app()->name . ' - About';
?>
<h3>About</h3>
<p>&nbsp;</p>
<p>
В процессе работы, как разработчик самого среднего звена, я сталкиваюсь с разноплановыми задачами по дизайну, верстке и серверному функционалу. Частенько забываются важные мелочи и детали, те или иные технологии. В связи с чем, я начал собирать решения различного рода проблем в одном месте. Оптимальным выходом показалось создать маленький блог, в котором я мог бы сохранять свой опыт, который в определенный момент может пригодиться.
</p>
<p>
Умею, могу:
</p>

<ul>
<li>
    Работаю в ОС Windows, Ubuntu;
</li>
<li>
Работаю с графическими программами Adobe, дизайн ряда сайтов, к примеру этот;
</li>
<li>
Верстаю кроссбраузерно, кроссплатформенно, сайты, веб интерфейсы, адаптивная верстка и email письма, с применением html, css, less, js, в том числе html5, css3, библиотека jQuery, фреймворк Bootstrap и т.д;
</li>
<li>
Работал с шаблонизаторами Twig;
</li>
<li>
Из cms работал с Orchard;
</li>
<li>
Работаю с php, наслышан об OOP, работал с MVC Фреймворками Yii, Kohana;
</li>
<li>
Работаю с Yii Active Record, Doctrine2, MySQL, пользуюсь HeidiSQL, MySQL Workbench;
</li>
<li>
Работал с поисковым движком Sphinx, планировщиком заданий Cron;
</li>
<li>
Есть опыт работы в команде, подозреваю, я прирожденный командор, работал с системами контроля версий git, svn, mercurial;
</li>
<li>
Работал со сборкой Open-server в Windows, работал с MAMP, WAMP, в Ubuntu работаю с Apache2, PHP5, MySQL;
</li>
</ul>
